CkovMk/HITSIC_RT1052/HITSIC_RT1052_MCUX/board/pin_mux.c
/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

/*
 * TEXT BELOW IS USED AS SETTING FOR TOOLS *************************************
!!GlobalInfo
product: Pins v8.0
processor: MIMXRT1052xxxxB
package_id: MIMXRT1052DVL6B
mcu_data: ksdk2_0
processor_version: 8.0.1
pin_labels:
- {pin_num: J1, pin_signal: GPIO_SD_B0_02, label: SDHC_D0, identifier: SDHC_D0}
- {pin_num: K1, pin_signal: GPIO_SD_B0_03, label: SDHC_D1, identifier: SDHC_D1}
- {pin_num: H2, pin_signal: GPIO_SD_B0_04, label: SDHC_D2, identifier: SDHC_D2}
- {pin_num: J2, pin_signal: GPIO_SD_B0_05, label: SDHC_D3, identifier: SDHC_D3}
- {pin_num: P2, pin_signal: GPIO_SD_B1_04, label: I2C1_SCL, identifier: I2C1_SCL;IMU_SCL;TCS_SCL;SCCB_SCL}
- {pin_num: J3, pin_signal: GPIO_SD_B0_01, label: SDHC_CLK, identifier: SDHC_CLK}
- {pin_num: J4, pin_signal: GPIO_SD_B0_00, label: SDHC_CMD, identifier: SDHC_CMD}
- {pin_num: L5, pin_signal: GPIO_SD_B1_00, label: UART4_TX, identifier: UART4_TX;WLAN_TX}
- {pin_num: M5, pin_signal: GPIO_SD_B1_01, label: UART4_RX, identifier: UART4_RX;WLAN_RX}
- {pin_num: A8, pin_signal: GPIO_B0_06, label: PWM2_A0, identifier: PWM2_A0;MOTOR_LA}
- {pin_num: A9, pin_signal: GPIO_B0_07, label: PWM2_B0, identifier: PWM2_B0;MOTOR_LB}
- {pin_num: B9, pin_signal: GPIO_B0_08, label: PWM2_A1, identifier: PWM2_A1;MOTOR_RB}
- {pin_num: C9, pin_signal: GPIO_B0_09, label: PWM2_B1, identifier: PWM2_B1;MOTOR_RA}
- {pin_num: D9, pin_signal: GPIO_B0_10, label: PWM2_A2, identifier: PWM2_A2;SERVO_B}
- {pin_num: A10, pin_signal: GPIO_B0_11, label: PWM2_B2, identifier: PWM2_B2;SERVO_F}
- {pin_num: D13, pin_signal: GPIO_B1_12, label: UART5_TX, identifier: UART5_TX;KV58_TX}
- {pin_num: D14, pin_signal: GPIO_B1_13, label: UART5_RX, identifier: UART5_RX;KV58_RX}
- {pin_num: B14, pin_signal: GPIO_B1_15, label: PWM4_A3, identifier: PWM4_A3}
- {pin_num: C14, pin_signal: GPIO_B1_14, label: PWM4_B3, identifier: PWM4_A2}
- {pin_num: K14, pin_signal: GPIO_AD_B0_12, label: UART1_TX, identifier: UART1_TX;DBG_TX}
- {pin_num: L14, pin_signal: GPIO_AD_B0_13, label: UART1_RX, identifier: UART1_RX;DBG_RX}
- {pin_num: C13, pin_signal: GPIO_B1_11, label: KEY_BTUP, identifier: KEY_BTUP}
- {pin_num: B13, pin_signal: GPIO_B1_10, label: KEY_BTOK, identifier: KEY_BTOK}
- {pin_num: A13, pin_signal: GPIO_B1_09, label: KEY_BTLF, identifier: KEY_BTLF}
- {pin_num: A12, pin_signal: GPIO_B1_08, label: KEY_BTRT, identifier: KEY_BTRT}
- {pin_num: B12, pin_signal: GPIO_B1_07, label: KEY_BTDN, identifier: KEY_BTDN}
- {pin_num: C12, pin_signal: GPIO_B1_06, label: BEEP_EN, identifier: BEEP_EN}
- {pin_num: D12, pin_signal: GPIO_B1_05, label: SERVO_EN, identifier: SERVO_EN}
- {pin_num: E12, pin_signal: GPIO_B1_04, label: KEY_BTSE, identifier: KEY_BTSE}
- {pin_num: D11, pin_signal: GPIO_B1_03, label: SERVO_FLT, identifier: SERVO_FLT}
- {pin_num: C11, pin_signal: GPIO_B1_02, label: MOTOR_EN, identifier: MOTOR_EN}
- {pin_num: B11, pin_signal: GPIO_B1_01, label: KEY_BTME, identifier: KEY_BTME}
- {pin_num: A11, pin_signal: GPIO_B1_00, label: MOTOR_FLT, identifier: MOTOR_FLT}
- {pin_num: E11, pin_signal: GPIO_B0_15, label: TOF0_XHT, identifier: TOF0_XHT}
- {pin_num: E10, pin_signal: GPIO_B0_14, label: TOF0_INT, identifier: TOF0_INT}
- {pin_num: D10, pin_signal: GPIO_B0_13, label: TOF1_XHT, identifier: TOF1_XHT}
- {pin_num: C10, pin_signal: GPIO_B0_12, label: TOF1_INT, identifier: TOF1_INT}
- {pin_num: B8, pin_signal: GPIO_B0_05, label: I2C2_SDA, identifier: I2C2_SDA;TOFn_SDA}
- {pin_num: C8, pin_signal: GPIO_B0_04, label: I2C2_SCL, identifier: I2C2_SCL;TOFn_SCL}
- {pin_num: D8, pin_signal: GPIO_B0_03, label: SPI4_SCK, identifier: SPI4_SCK;DISP_SCK}
- {pin_num: E8, pin_signal: GPIO_B0_02, label: SPI4_SDO, identifier: SPI4_SDO;DISP_SDO}
- {pin_num: E7, pin_signal: GPIO_B0_01, label: DISP_BKL, identifier: DISP_BKL}
- {pin_num: D7, pin_signal: GPIO_B0_00, label: DISP_D_C, identifier: DISP_D_C}
- {pin_num: C7, pin_signal: GPIO_EMC_41, label: DISP_RST, identifier: DISP_RST}
- {pin_num: N3, pin_signal: GPIO_SD_B1_05, label: I2C1_SDA, identifier: I2C1_SDA;IMU_SDA;TCS_SDA;SCCB_SDA}
- {pin_num: L12, pin_signal: GPIO_AD_B1_04, label: CAM_PCLK, identifier: CAM_PCLK}
- {pin_num: K12, pin_signal: GPIO_AD_B1_05, label: CAM_XCLK, identifier: CAM_XCLK}
- {pin_num: J12, pin_signal: GPIO_AD_B1_06, label: CAM_VSNC, identifier: CAM_VSNC}
- {pin_num: K10, pin_signal: GPIO_AD_B1_07, label: CAM_HREF, identifier: CAM_HREF}
- {pin_num: H13, pin_signal: GPIO_AD_B1_08, label: CAM_D9, identifier: CAM_D9}
- {pin_num: M13, pin_signal: GPIO_AD_B1_09, label: CAM_D8, identifier: CAM_D8}
- {pin_num: L13, pin_signal: GPIO_AD_B1_10, label: CAM_D7, identifier: CAM_D7}
- {pin_num: J13, pin_signal: GPIO_AD_B1_11, label: CAM_D6, identifier: CAM_D6}
- {pin_num: H12, pin_signal: GPIO_AD_B1_12, label: CAM_D5, identifier: CAM_D5}
- {pin_num: H11, pin_signal: GPIO_AD_B1_13, label: CAM_D4, identifier: CAM_D4}
- {pin_num: G12, pin_signal: GPIO_AD_B1_14, label: CAM_D3, identifier: CAM_D3}
- {pin_num: J14, pin_signal: GPIO_AD_B1_15, label: CAM_D2, identifier: CAM_D2}
- {pin_num: M12, pin_signal: GPIO_AD_B1_03, label: CAM_RST, identifier: CAM_RST}
- {pin_num: L11, pin_signal: GPIO_AD_B1_02, label: MOTOR_IR, identifier: MOTOR_IR}
- {pin_num: K11, pin_signal: GPIO_AD_B1_01, label: VOLT_BAT, identifier: VOLT_BATT}
- {pin_num: J11, pin_signal: GPIO_AD_B1_00, label: MOTOR_IL, identifier: MOTOR_IL}
- {pin_num: L10, pin_signal: GPIO_AD_B0_15, label: SERVO_IB, identifier: SERVO_IB}
- {pin_num: H14, pin_signal: GPIO_AD_B0_14, label: SERVO_IF, identifier: SERVO_IF}
- {pin_num: G10, pin_signal: GPIO_AD_B0_11, label: ENCO_RA, identifier: ENC_RA}
- {pin_num: G13, pin_signal: GPIO_AD_B0_10, label: ENC_RB, identifier: ENC_RB}
- {pin_num: F14, pin_signal: GPIO_AD_B0_09, label: ENC_LB, identifier: ENC_LB}
- {pin_num: F13, pin_signal: GPIO_AD_B0_08, label: ENC_LA, identifier: ENC_LA}
- {pin_num: F12, pin_signal: GPIO_AD_B0_07, label: SWCLK, identifier: SWCLK}
- {pin_num: E14, pin_signal: GPIO_AD_B0_06, label: SWDIO, identifier: SWDIO}
- {pin_num: G14, pin_signal: GPIO_AD_B0_05, label: BOOT_SEL1, identifier: BOOT_SEL1}
- {pin_num: F11, pin_signal: GPIO_AD_B0_04, label: BOOT_SEL0, identifier: BOOT_SEL0}
- {pin_num: G11, pin_signal: GPIO_AD_B0_03, label: LED_USR, identifier: LED_USR}
- {pin_num: M11, pin_signal: GPIO_AD_B0_02, label: LED_BUSG, identifier: LED_BUSG}
- {pin_num: H10, pin_signal: GPIO_AD_B0_01, label: KEY_BTUR, identifier: KEY_BTUS}
- {pin_num: M14, pin_signal: GPIO_AD_B0_00, label: LED_BUSR, identifier: LED_BUSR}
- {pin_num: M3, pin_signal: GPIO_SD_B1_02, label: TCS_INT, identifier: TCS_INT}
- {pin_num: M4, pin_signal: GPIO_SD_B1_03, label: IMU_INT, identifier: IMU_INT}
 * BE CAREFUL MODIFYING THIS COMMENT - IT IS YAML SETTINGS FOR TOOLS ***********
 */

#include "fsl_common.h"
#include "fsl_xbara.h"
#include "fsl_xbarb.h"
#include "fsl_iomuxc.h"
#include "fsl_gpio.h"
#include "pin_mux.h"

